package ua.Kharkov.Hitman.lessons.lessons1.dz.kostin.theme1;

public class Task2 {

	public static void main(String[] args) {
		/*
		 * 2. Создайте программу, которая вычислит выражение
		 * 14/209+14*(29-(13*13)+14/3) и выведет результат на экран. При этом
		 * число 14 обязательно сохраните в отдельной переменной, выбрав для неё
		 * подходящий тип.
		 */
		int d = 14;
		double n = d / 209 + d * (29 * (13 * 13) + d / 3);
		System.out.println(n);
	}

}
