package ua.Kharkov.Hitman.lessons.lessons1.dz.kostin.theme1;

public class Task1 {

	public static void main(String[] args) {
		/*
		 * 1. Создайте программу, которая вычислит выражение 20*1\3+(158*158) и
		 * выведет результат на экран.
		 */
		int a = 20;
		int b = 1;
		int c = 3;
		int y = 158 * 158;
		System.out.println(a * b / c + y);
	}

}
